const express = require("express");
const router = express.Router();

router.get("/", (req, res) => {
    res.send("سياسة الخصوصية " + "<br/>" +
    "سياسة الخصوصية    <br/>" +
    "بيان سياسة الخصوصية هذا يوضح كيف يستخدم حافل و يحمي أي معلومات يتم جمعها عند إستخدام هذا الموقع. يلتزم حافل بضمان خصوصيتك ومعلوماتك. <br/> سوف يطلب منك تقديم بعض المعلومات التي يمكن التعرف من خلالها على هويتك عند استخدام هذا التطبيق<br/> لن يتم إستخدام هذه المعلومات إلا وفقاً لبيان سياسة الخصوصية.قد تتغير سياسة الخصوصية للمظهر الطبي من وقت لآخر عن طريق تحديث هذه الصفحة. يجب عليك مراجعة هذه الصفحة من وقت لآخر للتأكد من رضاك عن أي تغيرات." + "<br/>" +
    "قد نقوم بجمع المعلومات التالية :" + "<br/>" +
    "الإسم" + "<br/>" +
    "معلومات الاتصال بما في ذلك عنوان البريد الإلكتروني" + "<br/>" +
    "معلومات ديموغرافية مثل الموقع الجغرافي, الرمز البريدي ،واهتماماتك <br/>" + "<br/>" +
    "معلومات أخرى ذات صلة لاستطلاعات العملاء و/ أو العروض    " + "<br/>" + "<br/>" +
    "كيفية إستخدام المعلومات المجموعة" + "<br/>" +
    "نحن بحاجة إلى هذه المعلومات لفهم احتياجاتك وتقديم خدمة أفضل ، وعلى وجه الخصوص للأسباب التالية :" + "<br/>" +
    "حفظ السجلات الداخلية ." + "<br/>" +
    "قد نستخدم هذه المعلومات لتحسين منتجاتنا وخدماتنا ." +"<br/>" +
    "قد نرسل رسائل البريد الإلكتروني الترويجية دوريا حول المنتجات الجديدة والعروض الخاصة أو غيرها من المعلومات التي نعتقد أنها قد تكون مثيرة لاهتماماتك بإستخدام عنوان البريد الإلكتروني  " + "<br/>" +
    "من وقت لآخر، قد نستخدم المعلومات الخاصة بك للتواصل معك لأغراض أبحاث التسويق . سيتم التواصل معك عن طريق البريد الإلكتروني ، الهاتف ، أو البريد. وقد نستخدم هذه المعلومات لتعديل التطبيق وفقاً لإهتماماتك ." + "<br/>" +"<br/>" +
    "نحن نستخدم ملفات الكوكيز لتسجيل حركة المرور وتحديد الصفحات التي تم زيارتها، مما يساعدنا على تحليل البيانات حول حركة المرور على الويب وتحسين موقعنا حسب إحتياجات العملاء. <br/> نحن فقط نستخدم هذه المعلومات لأغراض التحليل الإحصائي ومن ثم يتم إزالة البيانات من النظام." + "<br/>" +
    "ملفات الكوكيز تساعدنا على تقديم خدمة أفضل ، من خلال تمكيننا من رصد الصفحات التي تجدها مفيدة ، والتي لم تكن كذلك . <br/> ملفات الكوكيز بأي حال لا تتيح لنا الوصول إلى جهاز الكمبيوتر الخاص بك أو أي معلومات عنك ، وغيرها من البيانات التي لم تختارها للمشاركة معنا. <br/> يمكنك اختيار قبول أو رفض ملفات الكوكيز .معظم المتصفحات الإلكترونية تقبل ملفات الكوكيز ولكن بإمكانك تعديل إعدادات المتصفح لرفض ملفات الكوكيز إذا كنت تفضل ذلك مما قد يمنعك من الاستفادة الكاملة من الموقع." + "<br/>" +"<br/>" +
    "روابط لمواقع أخرى" +"<br/>" +
    "قد يحتوي موقعنا على روابط لمواقع أخرى . نريد لفت إنتباهك بأننا غير مسؤلين عن حماية خصوصية معلوماتك التي قد تقدمها أثناء زيارتك لتلك المواقع ، وهذه المواقع لا تخضع بيان الخصوصية هذا." +"<br/>" +
    "مشاركة معلوماتك مع أطراف أخرى" +"<br/>" +
    "نحن نستخدم معلوماتك الشخصية لإرسال معلومات عن العروض والمستجدات في متجرنا." +"<br/>" +
    "يمكنك اختيار عدم استخدام معلوماتك للتواصل معك لأغراض التسويق والعروض بإرسال طلبك على  <br/> hafelprog@gmail.com" )
})
module.exports = router;